Revit 2026 API

# SolidCurveIntersectionGetCurveSegment Method

---

Gets the curve segment generated by intersection.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Curve GetCurveSegment(
	int index
)
```
```vb
Public Function GetCurveSegment (
	index As Integer
) As Curve
```
```cpp
public:
Curve^ GetCurveSegment(
	int index
)
```
```fsharp
member GetCurveSegment :
        index : int -> Curve
```

#### Parameters

index Int32
     The index.

#### Return Value

Curve The curve.

| Exception | Condition |
| --- | --- |
| ArgumentException | index is out of range. |

#### Reference

SolidCurveIntersection Class

Autodesk.Revit.DB Namespace